In [1]:
import numpy as np
import pandas as pd

# 1.删除重复值：

In [2]:
df = pd.DataFrame({"a":["one","two","one","two","one","two","two"],"b":[1,2,3,4,5,6,6]})
df

     a  b
0  one  1
1  two  2
2  one  3
3  two  4
4  one  5
5  two  6
6  two  6

#### duplicated()方法

In [3]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

#### drop_duplicates()

In [4]:
df.drop_duplicates()

     a  b
0  one  1
1  two  2
2  one  3
3  two  4
4  one  5
5  two  6

#### 基于某一列来去除重复值

In [5]:
df.drop_duplicates(subset=["a"])

     a  b
0  one  1
1  two  2

#### 通过传入参数keep=last来保留最后一个

In [6]:
df.drop_duplicates(["a"],keep="last")

     a  b
4  one  5
6  two  6

# 2.使用函数或映射转换数据：

In [7]:
df = pd.DataFrame({'Name':['Tom','jerry','Alex','Jack','Aiden','Ryan'],'Height':[120,110,125,122,119,118]})
df

    Name  Height
0    Tom     120
1  jerry     110
2   Alex     125
3   Jack     122
4  Aiden     119
5   Ryan     118

#### 传递一个包含映射关系的字典型对象

In [8]:
Name_to_Grade = {'tom':3,'jerry':1,'alex':2,'jack':1,'aiden':3,'ryan':2}

In [9]:
df['Grade'] = df['Name'].map(lambda x:Name_to_Grade[x.lower()])

In [10]:
df

    Name  Height  Grade
0    Tom     120      3
1  jerry     110      1
2   Alex     125      2
3   Jack     122      1
4  Aiden     119      3
5   Ryan     118      2

#### 传递一个函数

In [11]:
def get_level(x):
    if x >=120:
        return 1
    else:
        return 2

In [12]:
df['Level'] = df['Height'].map(get_level)

In [13]:
df

    Name  Height  Grade  Level
0    Tom     120      3      1
1  jerry     110      1      2
2   Alex     125      2      1
3   Jack     122      1      1
4  Aiden     119      3      2
5   Ryan     118      2      2

# 3.替代值：

In [14]:
data = pd.Series([25,-999,36,56,-999,58,1000])
data

0      25
1    -999
2      36
3      56
4    -999
5      58
6    1000
dtype: int64

In [15]:
data.replace(-999 , np.nan)

0      25.0
1       NaN
2      36.0
3      56.0
4       NaN
5      58.0
6    1000.0
dtype: float64

In [16]:
data.replace([-999,1000] , np.nan)

0    25.0
1     NaN
2    36.0
3    56.0
4     NaN
5    58.0
6     NaN
dtype: float64

In [17]:
data.replace([-999,1000] , [np.nan,0])

0    25.0
1     NaN
2    36.0
3    56.0
4     NaN
5    58.0
6     0.0
dtype: float64

In [18]:
data.replace({-999:0 , 1000:np.nan})

0    25.0
1     0.0
2    36.0
3    56.0
4     0.0
5    58.0
6     NaN
dtype: float64

# 4.重命名轴索引：

In [19]:
df = pd.DataFrame({'Name':['Tom','jerry','Alex','Jack'],'Height':[120,110,125,122]},index=["one","two","three","four"])
df

        Name  Height
one      Tom     120
two    jerry     110
three   Alex     125
four    Jack     122

#### 轴索引的重命名

In [20]:
df.index = df.index.map(lambda x:x.title())

In [21]:
df.index

Index(['One', 'Two', 'Three', 'Four'], dtype='object')

In [22]:
df

        Name  Height
One      Tom     120
Two    jerry     110
Three   Alex     125
Four    Jack     122

#### rename 方法

In [23]:
df.rename(index=str.upper , columns=str.upper)

        NAME  HEIGHT
ONE      Tom     120
TWO    jerry     110
THREE   Alex     125
FOUR    Jack     122

In [24]:
df.rename(index={"Three":"三"} , columns={"Name":"姓名"})

         姓名  Height
One     Tom     120
Two   jerry     110
三      Alex     125
Four   Jack     122

In [25]:
df

        Name  Height
One      Tom     120
Two    jerry     110
Three   Alex     125
Four    Jack     122

In [26]:
df.rename(index={"Three":"三"} , columns={"Name":"姓名"} , inplace=True)

In [27]:
df

         姓名  Height
One     Tom     120
Two   jerry     110
三      Alex     125
Four   Jack     122